In [32]:
import pandas as pd
data=pd.read_csv(r"C:\Users\Admin\Downloads\raw_students.csv")
data

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email
5          6      John Doe      20    Male   85.0     john@example.com
6          7           NaN      22  Female   92.0      sarah@email.com
7          8  Michael King      23    Male   75.0    michael@email.com

In [34]:
data.head()

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  8 non-null      int64
 1   Name       7 non-null      object
 2   Age        7 non-null      object
 3   Gender     8 non-null      object
 4   Score      7 non-null      float64
 5   Email      8 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 516.0+ bytes

In [36]:
data["Age"]=pd.to_numeric(data["Age"],errors="coerce")

In [37]:
data.dtypes

StudentID      int64
Name          object
Age          float64
Gender        object
Score        float64
Email         object
dtype: object

In [38]:
data

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  20.0    male   85.0     john@example.com
1          2   Jane Smith   19.0  Female   90.0  janesmith@email.com
2          3   Bob Johnson   NaN    Male   78.0       bobj@email.com
3          4   Alice Brown  21.0  Female    NaN      alice@email.com
4          5     Chris Lee   NaN    Male   88.0          chris@email
5          6      John Doe  20.0    Male   85.0     john@example.com
6          7           NaN  22.0  Female   92.0      sarah@email.com
7          8  Michael King  23.0    Male   75.0    michael@email.com

In [39]:
data.isnull().sum()

StudentID    0
Name         1
Age          2
Gender       0
Score        1
Email        0
dtype: int64

In [40]:
data["Age"].fillna(data["Age"].mean(),inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_11088\948062835.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Age"].fillna(data["Age"].mean(),inplace=True)

In [41]:
data

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female    NaN      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [42]:
data["Score"].fillna(data["Score"].median(),inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_11088\2668061305.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Score"].fillna(data["Score"].median(),inplace=True)

In [43]:
data

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female   85.0      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [45]:
data["Age"]=data["Age"].astype("int")

In [46]:
data

   StudentID          Name  Age  Gender  Score                Email
0          1      John doe   20    male   85.0     john@example.com
1          2   Jane Smith    19  Female   90.0  janesmith@email.com
2          3   Bob Johnson   20    Male   78.0       bobj@email.com
3          4   Alice Brown   21  Female   85.0      alice@email.com
4          5     Chris Lee   20    Male   88.0          chris@email
5          6      John Doe   20    Male   85.0     john@example.com
6          7           NaN   22  Female   92.0      sarah@email.com
7          8  Michael King   23    Male   75.0    michael@email.com

In [47]:
data["Name"]=data["Name"].fillna("Unknown")

In [50]:
data

   StudentID          Name  Age  Gender  Score                Email
0          1      John doe   20    male   85.0     john@example.com
1          2   Jane Smith    19  Female   90.0  janesmith@email.com
2          3   Bob Johnson   20    Male   78.0       bobj@email.com
3          4   Alice Brown   21  Female   85.0      alice@email.com
4          5     Chris Lee   20    Male   88.0          chris@email
5          6      John Doe   20    Male   85.0     john@example.com
6          7       Unknown   22  Female   92.0      sarah@email.com
7          8  Michael King   23    Male   75.0    michael@email.com

In [52]:
data.drop_duplicates()

   StudentID          Name  Age  Gender  Score                Email
0          1      John doe   20    male   85.0     john@example.com
1          2   Jane Smith    19  Female   90.0  janesmith@email.com
2          3   Bob Johnson   20    Male   78.0       bobj@email.com
3          4   Alice Brown   21  Female   85.0      alice@email.com
4          5     Chris Lee   20    Male   88.0          chris@email
5          6      John Doe   20    Male   85.0     john@example.com
6          7       Unknown   22  Female   92.0      sarah@email.com
7          8  Michael King   23    Male   75.0    michael@email.com

In [66]:
  data["Name"]=data["Name"].str.strip().str.lower()

In [70]:
data

   StudentID          Name  Age  Gender  Score                Email
0          1      john doe   20    Male   85.0     john@example.com
1          2    jane smith   19  Female   90.0  janesmith@email.com
2          3   bob johnson   20    Male   78.0       bobj@email.com
3          4   alice brown   21  Female   85.0      alice@email.com
4          5     chris lee   20    Male   88.0          chris@email
5          6      john doe   20    Male   85.0     john@example.com
6          7       unknown   22  Female   92.0      sarah@email.com
7          8  michael king   23    Male   75.0    michael@email.com

In [71]:
  data["Gender"]=data["Gender"].str.strip().str.capitalize()

In [73]:
data

   StudentID          Name  Age  Gender  Score                Email
0          1      john doe   20    Male   85.0     john@example.com
1          2    jane smith   19  Female   90.0  janesmith@email.com
2          3   bob johnson   20    Male   78.0       bobj@email.com
3          4   alice brown   21  Female   85.0      alice@email.com
4          5     chris lee   20    Male   88.0          chris@email
5          6      john doe   20    Male   85.0     john@example.com
6          7       unknown   22  Female   92.0      sarah@email.com
7          8  michael king   23    Male   75.0    michael@email.com

In [78]:
data.drop_duplicates("Name")

   StudentID          Name  Age  Gender  Score                Email
0          1      john doe   20    Male   85.0     john@example.com
1          2    jane smith   19  Female   90.0  janesmith@email.com
2          3   bob johnson   20    Male   78.0       bobj@email.com
3          4   alice brown   21  Female   85.0      alice@email.com
4          5     chris lee   20    Male   88.0          chris@email
6          7       unknown   22  Female   92.0      sarah@email.com
7          8  michael king   23    Male   75.0    michael@email.com